import ITerm from '~/models/ITerm';

/**
 * An array of all the available terms.
 */
export const termsData: ITerm[] = [
  {
    urlPath: 'צעדים-ראשונים',
    displayName: 'צעדים ראשונים',
    description: ` התחל להשתמש בתבנית ״ידע״. 
    למדו על הפרויקט ועל הטכנולוגיות והדרישות המקדימות שלו
    `,
  },
  {
    urlPath: 'התקנה',
    displayName: 'התקנה',
    description: 'התקן את הפרויקט לסביבה הלוקאלית שלך.',
  },
  {
    urlPath: 'מבנה-הפרויקט',
    displayName: 'מבנה הפרויקט ',
    description: `למד את מבנה הפרויקט - תיקיות וקבצים חשובים שאותם נשנה לצורך התאמה אישית 
    של התבנית.
    `,
  },
  {
    urlPath: 'הוסף-מונחים',
    displayName: 'הוסף מונחים',
    description: `תוכלו להוסיף מונחים חדשים לתפריט אתר בקלות רבה, באמצעות יצירה של דפים בפורמט markdown.`,
  },
  {
    urlPath: 'עיצוב-אישי',
    displayName: 'עיצוב האתר',
    description: `התאמה אישית של עיצוב האתר באמצעות תכונות גלובליות תוך שימוש בפורמט sass.`,
  },
  {
    urlPath: 'רכיבים-ויזואלים',
    displayName: 'רכיבים ויזואלים',
    description: `רכיבים ויזואלים משמעותיים שמופיעים בתבנית. למשל, תפריט צדדי, כפתורים ועוד.`,
  },
  {
    urlPath: 'תרמו-קוד',
    displayName: 'תרמו קוד לפרויקט',
    description: `מצאתם בעיה שאתם רוצים לתקן? יש לכם רעיון איך לשפר את הפרויקט או לתקן בעיות קיימות? אתם מומלצים להיכנס לעמוד הגיטהאב הרשמי שלנו ולתרום קוד!`,
  },
];
